srds-results/macrobench/single_node/dropbox/confd_int_sign/cauchy_rsa_sha_512/stdout-1.txt
File //random1.dat could not be found
Creating data file...done
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.2.23 (be patient)...INFO: PUT header == 
---
PUT / HTTP/1.0
Content-length: 1048576
Content-type: text/plain
Host: 172.16.2.23:3000
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:19 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

2c9aab97-b140-4b8d-a14a-8f3fe22c9879
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:20 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

13bd4fc9-bbd1-4d71-8f8b-f87b73d739b3
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:20 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

ec80380e-3e63-439f-a760-c5390db79da5
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:21 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

e01bd9b1-6a79-49f0-bd0c-6b4023188d10
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:34 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

7a27f0f6-e198-49c9-a0f4-3f40a9e9f401
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:34 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

b643cea1-d058-40b4-bde3-69a2431ac1ac
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:35 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

e82f240d-a997-4d92-9137-51c36a495b9b
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:39 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

022e3dea-90ea-4916-af7e-b3ae6f6b4b90
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:49 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

df05e026-18b9-4332-8047-72f69021ef98
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:49 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

dec3136d-abcf-4c9c-83c3-81d8c44cb75f
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:51 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

23bbc334-767d-480d-950c-f3b35ae0c492
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:14:55 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

6944e2cf-8180-4faf-a525-56630acd687c
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:05 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

5b4e33a8-17a6-43cc-a811-1f5d4896e028
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:06 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

2abfa7a6-ecd9-412f-a621-ba3451f42215
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:07 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

9f97a3c6-23a1-462d-a34d-16f03edf0eaa
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:12 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

5b76d5d7-5e11-482b-a4c4-8fe7c3337f1c
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:12 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

7c33ee3c-967b-4c28-8719-a9dc49c3dc1c
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:13 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

3b93a5a1-c7c6-49c4-9210-964bf2760ee9
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:24 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

2d2177ee-440e-47f7-8993-4d6734c97369
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:29 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

a8eadeab-63dc-4eb4-a535-2f7abdaf5a7d
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:30 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

31bead3e-6957-464c-b66b-140e3f6a1aa0
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:31 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

82e2d5fd-6e14-4bbd-a490-89d88c370df3
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:42 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

43b4cf02-7a87-4fcf-a806-41851612acfc
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:47 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

de84e5ed-a84f-480e-bdbd-8205795b09e0
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:47 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

de978bb5-422b-4b11-afbf-914eeb89b1c8
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:48 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

d93c5bd8-2e84-4e5d-b674-c96453c35375
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:15:54 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

c7e5eee9-cb8b-44c6-9a2f-4fb9660c0401
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:02 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

d3ca10d6-dcdc-4f5a-9f2f-0e20b48bd7ab
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:02 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

dea70af4-2b28-4fbe-a3e2-eacb3bf741ff
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:06 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

0dc08325-1451-4e9c-8ed5-cfac005f2ac9
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:11 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

a2ce1553-3155-4015-b229-704dc8ab7361
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:19 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

18ddec68-3347-437f-a564-10d9af8f7637
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:20 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

8434e3ea-abbb-4713-a1cb-cc2c9abd2531
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:22 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

f5d83664-bbe6-467a-ac68-dfbef63d67f0
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:27 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

fa6848a9-9d96-4fab-abc2-e8c77b55440d
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:35 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

c8ab5430-797d-41c8-94a0-e2a5ebb706af
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:35 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

7acae507-ff3b-4332-b76e-db3a958a4792
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:38 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

badd65d3-6ddd-4afb-9a7f-f09caab544d5
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:43 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

eca614ee-b35d-4bae-a7f2-5e35863899b7
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:51 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

136e2e07-2e10-41f9-943f-a4556e3b2a47
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:52 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

554576e2-896a-4116-985d-b5f0d0c66166
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:53 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

70089c01-cb88-43e3-b805-b976798aaa79
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:16:58 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

ece9618a-9a87-4a17-9114-1f8afea1123d
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:17:03 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

7a8dfe77-fb6f-4124-8c05-b5904dd5d14b
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:17:10 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

90e67e66-1799-47ee-81a7-6751945b6f7b
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:17:16 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

1be5c40f-f00a-4dde-bb75-f6e54fe4770d
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:17:18 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

666593ea-26f8-40ef-9252-ceac19a6618c
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:17:20 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

825e014a-b270-4a31-8ca5-1d3343bbe3fa
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:17:25 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

67ccf705-b578-4b25-ac6f-268380bd1cf7
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:17:30 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

4725959c-e3d7-4ff1-9511-36efd88ab4de
LOG: Response code = 200
..done


Server Software:        PasteWSGIServer/0.5
Server Hostname:        172.16.2.23
Server Port:            3000

Document Path:          /
Document Length:        36 bytes

Concurrency Level:      4
Time taken for tests:   207.484 seconds
Complete requests:      50
Failed requests:        0
Total transferred:      9750 bytes
Total body sent:        52435550
HTML transferred:       1800 bytes
Requests per second:    0.24 [#/sec] (mean)
Time per request:       16598.689 [ms] (mean)
Time per request:       4149.672 [ms] (mean, across all concurrent requests)
Transfer rate:          0.05 [Kbytes/sec] received
                        246.80 kb/s sent
                        246.84 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   8.4      0      53
Processing:  4698 16042 2907.4  16557   24528
Waiting:     4690 16033 2907.2  16547   24520
Total:       4698 16044 2908.2  16558   24529

Percentage of the requests served within a certain time (ms)
  50%  16558
  66%  17298
  75%  17549
  80%  17675
  90%  18466
  95%  18802
  98%  24529
  99%  24529
 100%  24529 (longest request)